&После("ПриЗаписи")
Процедура Алго_ПриЗаписи(Отказ)

	Сертификат = ПолучитьДанныеПоСертификату();

	Для Каждого Строка из ЭтотОбъект.ТаблицаСертификатов Цикл
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СертификатСоответствия.Сертификаты КАК Сертификаты,
		|	СертификатСоответствия.Номенклатура КАК Номенклатура,
		|	СертификатСоответствия.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	СертификатСоответствия.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	РегистрСведений.СертификатСоответствия КАК СертификатСоответствия
		|ГДЕ
		|	СертификатСоответствия.Сертификаты = &Сертификаты
		|	И СертификатСоответствия.Номенклатура = &Номенклатура";

		//Запрос.УстановитьПараметр("Сертификаты", Сертификаты);
		//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);  //
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			ТекЗапись = РегистрыСведений.СертификатСоответствия.СоздатьМенеджерЗаписи();
			ТекЗапись.Сертификаты = Выборка.Сертификаты;
			ТекЗапись.Номенклатура = Выборка.Номенклатура;
			ТекЗапись.ДатаНачалаДействия = Выборка.ДатаНачалаДействия;
			ТекЗапись.ДатаОкончанияДействия = Выборка.ДатаОкончанияДействия;;
			ТекЗапись.Записать(Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДанныеПоСертификату()

	Сертификат = Новый Массив();
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование,
	|	НоменклатураТаблицаСертификатов.СправочникСертификатов.Наименование КАК СправочникСертификатовНаименование,
	|	НоменклатураТаблицаСертификатов.СправочникСертификатов.ДатаНачалаДействия КАК СправочникСертификатовДатаНачалаДействия,
	|	НоменклатураТаблицаСертификатов.СправочникСертификатов.ДатаОкончанияДействия КАК СправочникСертификатовДатаОкончанияДействия
	|ИЗ
	|	Справочник.Номенклатура.ТаблицаСертификатов КАК НоменклатураТаблицаСертификатов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО НоменклатураТаблицаСертификатов.Ссылка = Номенклатура.Ссылка";

	Запрос.УстановитьПараметр(Наименование, Наименование);
	//Запрос.УстановитьПараметр(СправочникСертикакаовНаименование, СправочникСертикакаовНаименование);

    РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Пока РезультатЗапроса.Следующий() Цикл

		НоваяЗапись = Новый Структура("Наименование, СправочникСертикакаовНаименование, СправочникСертикакаовДатаНачалаДействия, СправочникСертикакаовДатаОкончанияДействия");
		НоваяЗапись.Наименование = Строка(РезультатЗапроса.Наименование);
		//НоваяЗапись.СправочникСертикакаовНаименование = Строка(Выборка.СправочникСертикакаовНаименование);
		//НоваяЗапись.СправочникСертикакаовДатаНачалаДействия = Строка(Выборка.СправочникСертикакаовДатаНачалаДействия);
		//НоваяЗапись.СправочникСертикакаовДатаОкончанияДействия = Строка(Выборка.СправочникСертикакаовДатаОкончанияДействия);
		Сертификат.Добавить(НоваяЗапись);

	КонецЦикла;

	Возврат Сертификат;


КонецФункции
